data = input("커피값 입력 : ")           # 변수 ram 저장
a = int(data)                           # 커피값(변수?)의 정수 저장
pp = input("커피 인원수 : ")             # 변수 ram 저장
b = int(pp)                             # 입력값의 정수화
sum=a*b                                 # 커피값과 커피 인원수의 곱
c = 2000                                # 숫자
if sum >= 20000:                        # 조건문(비교연산자)
    print("2000원을 할인해 드립니다.")    # "입력"값 출력 (조건문 결과가 참)
    print("할인된 값 =",sum-c,"원")      # "입력"값 출력 / 총값 - 할인된 값

else:
    print("계산값을 다 지불하셔야합니다.") # 조건문 결과가 거짓
    print("계산값 =", sum, "원")               # sum(총 값)

