# while True:
#     print('1시간 남았어요.')
# 한줄 주석 처리
# 컨트롤 + / : 자동주석

# a=10
# while a> 0:
#     print(a)
#     a = a - 1

# 1. 0부터 99까지 찍어보세요.
b = 0
# while b < 100:
#     print(b)
#     b = b + 1
# 2.1부터 100까지 찍어보세요

# while b <= 100:
#     print(b + 1)
#     b = b + 1
# 3. 1부터 100까지 중 짝수만 찍어보세요.

# while b < 100:
#     if(b % 2 == 0):
#         print(b)
#     b = b +1
# 4. 0~99 중 3의 배수를 찍어보세요.
# while b < 100:
#     if(b % 3 ==0):
#         print(b)
#     b = b +1
# 5 0~99 중 5의 배수의 개수를 구해보세요.
c = 0
while b < 100:
    if(b % 5 == 0):
       c = c + 1
    b = b + 1
print('5의 배수는',c,'개')
#6. 안녕히가세요 5번 프린트
# a = 0  #시작
# while a < 5: #조건
#     print('안녕히가세요')
#     a = a + 1 #증감식




